{
  "architectures": [
    "VJEPA2Model"
  ],
  "attention_probs_dropout_prob": 0.0,
  "crop_size": 256,
  "drop_path_rate": 0.0,
  "frames_per_clip": 64,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "image_size": 256,
  "in_chans": 3,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-06,
  "mlp_ratio": 4,
  "model_type": "vjepa2",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "patch_size": 16,
  "pred_hidden_size": 384,
  "pred_mlp_ratio": 4.0,
  "pred_num_attention_heads": 12,
  "pred_num_hidden_layers": 12,
  "pred_num_mask_tokens": 10,
  "pred_zero_init_mask_tokens": true,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.0.dev0",
  "tubelet_size": 2,
  "use_SiLU": false,
  "wide_SiLU": true
}
